; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	image2 - mode
	infrared1 - mode
	Star2 - direction
	GroundStation8 - direction
	Star9 - direction
	Star13 - direction
	Star6 - direction
	Star0 - direction
	GroundStation7 - direction
	Star5 - direction
	GroundStation1 - direction
	Star11 - direction
	Star14 - direction
	Star12 - direction
	Star10 - direction
	Star3 - direction
	GroundStation4 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Star21 - direction
	Star22 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star6)
	(supports instrument1 image2)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star10)
	(supports instrument2 image2)
	(calibration_target instrument2 Star11)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared1)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 Star12)
	(calibration_target instrument4 Star14)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon19)
)
(:goal (and
	(pointing satellite0 Planet20)
	(have_image Planet15 infrared1)
	(have_image Planet16 spectrograph0)
	(have_image Phenomenon17 infrared1)
	(have_image Star18 spectrograph0)
	(have_image Phenomenon19 infrared1)
	(have_image Planet20 spectrograph0)
	(have_image Star21 image2)
	(have_image Star22 image2)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 9
2. (turn_to satellite0 planet20 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet20)
   goals met: 1 of 9
3. (turn_to satellite1 star3 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 star3)
   goals met: 1 of 9
4. (calibrate satellite1 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 1 of 9
5. (turn_to satellite1 phenomenon17 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon17)
   goals met: 1 of 9
6. (take_image satellite1 phenomenon17 instrument4 infrared1)
   added: (have_image phenomenon17 infrared1)
   goals met: 2 of 9
7. (turn_to satellite1 phenomenon19 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon19)
   goals met: 2 of 9
8. (take_image satellite1 phenomenon19 instrument4 infrared1)
   added: (have_image phenomenon19 infrared1)
   goals met: 3 of 9
9. (turn_to satellite1 planet15 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 planet15)
   goals met: 3 of 9
10. (take_image satellite1 planet15 instrument4 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 4 of 9
11. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 4 of 9
12. (take_image satellite1 planet16 instrument4 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 5 of 9
13. (turn_to satellite1 planet20 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet20)
   goals met: 5 of 9
14. (take_image satellite1 planet20 instrument4 spectrograph0)
   added: (have_image planet20 spectrograph0)
   goals met: 6 of 9
15. (turn_to satellite1 star18 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 star18)
   goals met: 6 of 9
16. (take_image satellite1 star18 instrument4 spectrograph0)
   added: (have_image star18 spectrograph0)
   goals met: 7 of 9
17. (turn_to satellite1 star21 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star21)
   goals met: 7 of 9
18. (take_image satellite1 star21 instrument4 image2)
   added: (have_image star21 image2)
   goals met: 8 of 9
19. (turn_to satellite1 star22 star21)
   deleted: (pointing satellite1 star21)
   added: (pointing satellite1 star22)
   goals met: 8 of 9
20. (take_image satellite1 star22 instrument4 image2)
   added: (have_image star22 image2)
   goals met: 9 of 9
